giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
/*
 * Academic License - for use in teaching, academic research, and meeting
 * course requirements at degree granting institutions only.  Not for
 * government, commercial, or other organizational use.
 *
 * File: mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
 *
 * Code generated for Simulink model 'mcb_pmsm_foc_sensorless_f28069MLaunchPad'.
 *
 * Model version                  : 9.20
 * Simulink Coder version         : 24.2 (R2024b) 21-Jun-2024
 * C/C++ source code generated on : Tue May 27 12:41:05 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef mcb_pmsm_foc_sensorless_f28069MLaunchPad_h_
#define mcb_pmsm_foc_sensorless_f28069MLaunchPad_h_
#ifndef mcb_pmsm_foc_sensorless_f28069MLaunchPad_COMMON_INCLUDES_
#define mcb_pmsm_foc_sensorless_f28069MLaunchPad_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif           /* mcb_pmsm_foc_sensorless_f28069MLaunchPad_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "mcb_pmsm_foc_sensorless_f28069MLaunchPad_types.h"
#include <string.h>
#include "rt_nonfinite.h"
#include <stddef.h>
#include "zero_crossing_types.h"
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define mcb_pmsm_foc_sensorless_f28069MLaunchPad_M (mcb_pmsm_foc_sensorless_f280_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S23>/Two phase CRL wrap' */
typedef struct {
  real32_T a_plus_2b;                  /* '<S24>/a_plus_2b' */
  real32_T one_by_sqrt3;               /* '<S24>/one_by_sqrt3' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwophaseCRLwrap_mcb_pmsm_fo;

/* Block signals for system '<S20>/Two inputs CRL' */
typedef struct {
  real32_T acos_a;                     /* '<S53>/acos' */
  real32_T bsin;                       /* '<S53>/bsin' */
  real32_T sum_Ds;                     /* '<S53>/sum_Ds' */
  real32_T bcos;                       /* '<S53>/bcos' */
  real32_T asin_p;                     /* '<S53>/asin' */
  real32_T sum_Qs;                     /* '<S53>/sum_Qs' */
  real32_T Switch[2];                  /* '<S54>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwoinputsCRL_mcb_pmsm_foc_s;

/* Block signals for system '<S57>/If Action Subsystem' */
typedef struct {
  real32_T Convert_back;               /* '<S60>/Convert_back' */
  int16_T Convert_uint16;              /* '<S60>/Convert_uint16' */
} rtB_IfActionSubsystem_mcb_pmsm_;

/* Block signals for system '<S57>/If Action Subsystem1' */
typedef struct {
  real32_T Convert_back;               /* '<S61>/Convert_back' */
  int16_T Convert_uint16;              /* '<S61>/Convert_uint16' */
} rtB_IfActionSubsystem1_mcb_pmsm;

/* Block signals for system '<S273>/Dir_Sense' */
typedef struct {
  int16_T Switch;                      /* '<S281>/Switch' */
  boolean_T LogicalOperator;           /* '<S281>/Logical Operator' */
} rtB_Dir_Sense_mcb_pmsm_foc_sens;

/* Zero-crossing (trigger) state for system '<S273>/Dir_Sense' */
typedef struct {
  ZCSigState Dir_Sense_Trig_ZCE;       /* '<S273>/Dir_Sense' */
} rtZCE_Dir_Sense_mcb_pmsm_foc_se;

/* Block signals for system '<S312>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S312>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_mcb_pmsm_;

/* Block states (default storage) for system '<S312>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S312>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S312>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_mcb_pmsm;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Iq_switch_mem;              /* '<S326>/Data Store Read3' */
  real32_T RateLimiter;                /* '<S327>/Rate Limiter' */
  real32_T RateLimiter1;               /* '<S327>/Rate Limiter1' */
  real32_T Switch;                     /* '<S327>/Switch' */
  real32_T Switch1[2];                 /* '<S330>/Switch1' */
  real32_T Product;                    /* '<S387>/Product' */
  real32_T UnitDelay;                  /* '<S387>/Unit Delay' */
  real32_T Product1;                   /* '<S387>/Product1' */
  real32_T Add1;                       /* '<S387>/Add1' */
  real32_T Sum;                        /* '<S326>/Sum' */
  real32_T Product_g;                  /* '<S326>/Product' */
  real32_T Sum1;                       /* '<S326>/Sum1' */
  real32_T I_q_ref;                    /* '<S326>/MATLAB Function' */
  boolean_T DataStoreRead1;            /* '<S326>/Data Store Read1' */
  boolean_T DataStoreRead2;            /* '<S326>/Data Store Read2' */
  boolean_T AND;                       /* '<S326>/AND' */
  boolean_T LogicalOperator;           /* '<S326>/Logical Operator' */
} rtB_SpeedControl_mcb_pmsm_foc_s;

/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S387>/Unit Delay' */
  real32_T PrevY;                      /* '<S327>/Rate Limiter' */
  real32_T PrevY_f;                    /* '<S327>/Rate Limiter1' */
  real32_T integrator_state;           /* '<S326>/MATLAB Function' */
} rtDW_SpeedControl_mcb_pmsm_foc_;

/* Block signals for system '<S389>/RunMode.ComputeId0' */
typedef struct {
  real32_T Sum;                        /* '<S408>/Sum' */
  real32_T Switch;                     /* '<S408>/Switch' */
  boolean_T Compare;                   /* '<S409>/Compare' */
} rtB_RunModeComputeId0_mcb_pmsm_;

