giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
/* Block signals (default storage) */
typedef struct {
  real_T Product;                      /* '<S26>/Product' */
  real_T Add;                          /* '<S26>/Add' */
  real_T Product1;                     /* '<S26>/Product1' */
  real_T Add1;                         /* '<S26>/Add1' */
  uint32_T Sum[4];                     /* '<S398>/Sum' */
  uint32_T Sum_k[4];                   /* '<S55>/Sum' */
  uint32_T DataTypeConversion;         /* '<S110>/Data Type Conversion' */
  uint32_T Sum_j[4];                   /* '<S225>/Sum' */
  uint32_T PositionToCount;            /* '<S236>/PositionToCount' */
  uint32_T Delay;                      /* '<S236>/Delay' */
  uint32_T PositionToCount_i;          /* '<S279>/PositionToCount' */
  uint32_T Delay_l;                    /* '<S279>/Delay' */
  real32_T SpdCmd;                     /* '<S8>/RT6' */
  real32_T UnitDelay;                  /* '<S8>/Unit Delay' */
  real32_T RT6;                        /* '<Root>/RT6' */
  real32_T RT4;                        /* '<Root>/RT4' */
  real32_T RT2[2];                     /* '<Root>/RT2' */
  real32_T SpdRef;                     /* '<S8>/State Machine OL - CL' */
  real32_T Id0_out;                    /* '<S8>/State Machine OL - CL' */
  real32_T Id0_in;                     /* '<S8>/State Machine OL - CL' */
  real32_T RAMP_STEP_SIZE;             /* '<S8>/State Machine OL - CL' */
  real32_T DataStoreRead3;             /* '<S388>/Data Store Read3' */
  real32_T DataStoreRead1;             /* '<S388>/Data Store Read1' */
  real32_T DataStoreRead2;             /* '<S388>/Data Store Read2' */
  real32_T Merge;                      /* '<S400>/Merge' */
  real32_T indexing;                   /* '<S398>/indexing' */
  real32_T Lookup[4];                  /* '<S398>/Lookup' */
  real32_T Sum3;                       /* '<S399>/Sum3' */
  real32_T DataTypeConversion1;        /* '<S398>/Data Type Conversion1' */
  real32_T Sum2;                       /* '<S398>/Sum2' */
  real32_T Product_b;                  /* '<S399>/Product' */
  real32_T Sum4;                       /* '<S399>/Sum4' */
  real32_T Sum5;                       /* '<S399>/Sum5' */
  real32_T Product1_a;                 /* '<S399>/Product1' */
  real32_T Sum6;                       /* '<S399>/Sum6' */
  real32_T DataStoreRead;              /* '<S388>/Data Store Read' */
  real32_T DataStoreRead4;             /* '<S388>/Data Store Read4' */
  real32_T DataTypeConversion1_a[2];   /* '<S323>/Data Type Conversion1' */
  real32_T Speed_Ref;                  /* '<S6>/Data Type Conversion1' */
  real32_T DataTypeConversion1_p[2];   /* '<S78>/Data Type Conversion1' */
  real32_T Delay5[4];                  /* '<S1>/Delay5' */
  real32_T Merge_k[2];                 /* '<S79>/Merge' */
  real32_T Spd_Pos;                    /* '<S19>/Data Store Read' */
  real32_T Gain;                       /* '<S19>/Gain' */
  real32_T Delay_g;                    /* '<S19>/Delay' */
  real32_T Add_g;                      /* '<S51>/Add' */
  real32_T DataTypeConversion1_d;      /* '<S51>/Data Type Conversion1' */
  real32_T Add1_f;                     /* '<S51>/Add1' */
  real32_T Switch;                     /* '<S19>/Switch' */
  real32_T Merge_c;                    /* '<S57>/Merge' */
  real32_T indexing_d;                 /* '<S55>/indexing' */
  real32_T Lookup_f[4];                /* '<S55>/Lookup' */
  real32_T Sum3_b;                     /* '<S56>/Sum3' */
  real32_T DataTypeConversion1_c;      /* '<S55>/Data Type Conversion1' */
  real32_T Sum2_e;                     /* '<S55>/Sum2' */
  real32_T Product_g;                  /* '<S56>/Product' */
  real32_T Sum4_h;                     /* '<S56>/Sum4' */
  real32_T Sum5_l;                     /* '<S56>/Sum5' */
  real32_T Product1_e;                 /* '<S56>/Product1' */
  real32_T Sum6_c;                     /* '<S56>/Sum6' */
  real32_T Sum_m;                      /* '<S28>/Sum' */
  real32_T Vq_computed;                /* '<S28>/Vq_computed1' */
  real32_T Product_bk;                 /* '<S28>/Product' */
  real32_T Sum1;                       /* '<S28>/Sum1' */
  real32_T Switch_j;                   /* '<S28>/Switch' */
  real32_T Sum_g;                      /* '<S27>/Sum' */
  real32_T Vd_computed1;               /* '<S27>/Vd_computed1' */
  real32_T Product_e;                  /* '<S27>/Product' */
  real32_T Sum1_a;                     /* '<S27>/Sum1' */
  real32_T Vd_OpenLoop;                /* '<S27>/Vd_OpenLoop' */
  real32_T Abs;                        /* '<S27>/Abs' */
  real32_T Switch1[2];                 /* '<S43>/Switch1' */
  real32_T Product_bh;                 /* '<S47>/Product' */
  real32_T UnitDelay_n;                /* '<S47>/Unit Delay' */
  real32_T Product1_p;                 /* '<S47>/Product1' */
  real32_T Add1_l;                     /* '<S47>/Add1' */
  real32_T Switch_d;                   /* '<S27>/Switch' */
  real32_T Switch_jv;                  /* '<S31>/Switch' */
  real32_T Product_l;                  /* '<S31>/Product' */
  real32_T Product_o;                  /* '<S32>/Product' */
  real32_T Product1_ad;                /* '<S32>/Product1' */
  real32_T Sum1_e;                     /* '<S32>/Sum1' */
  real32_T Merge_m[2];                 /* '<S25>/Merge' */
  real32_T CastToSingle1;              /* '<S26>/Cast To Single1' */
  real32_T CastToSingle;               /* '<S26>/Cast To Single' */
  real32_T DataTypeConversion_c;       /* '<S14>/Data Type Conversion' */
  real32_T Speed_fb_PU;                /* '<S1>/Input Scaling' */
  real32_T TmpSignalConversionAtDelay5Inpo[4];
  real32_T sqrt3_by_two;               /* '<S69>/sqrt3_by_two' */
  real32_T one_by_two;                 /* '<S69>/one_by_two' */
  real32_T add_c;                      /* '<S69>/add_c' */
  real32_T add_b;                      /* '<S69>/add_b' */
  real32_T Min;                        /* '<S66>/Min' */
  real32_T Max;                        /* '<S66>/Max' */
  real32_T Add_i;                      /* '<S66>/Add' */
  real32_T one_by_two_d;               /* '<S66>/one_by_two' */
  real32_T Add3;                       /* '<S65>/Add3' */
  real32_T Add2;                       /* '<S65>/Add2' */
  real32_T Add1_b;                     /* '<S65>/Add1' */
  real32_T Gain_c[3];                  /* '<S65>/Gain' */
  real32_T Gain_c1[3];                 /* '<S14>/Gain' */
  real32_T PWM_Duty_Cycles[3];         /* '<S14>/Sum' */
  real32_T Delay1;                     /* '<S83>/Delay1' */
  real32_T Delay_f[2];                 /* '<S84>/Delay' */
  real32_T Gain_m;                     /* '<S89>/Gain' */
  real32_T UnaryMinus;                 /* '<S97>/Unary Minus' */
  real32_T Product1_f;                 /* '<S86>/Product1' */
  real32_T Gain1;                      /* '<S96>/Gain1' */
  real32_T Product2;                   /* '<S97>/Product2' */
  real32_T Product_k;                  /* '<S86>/Product' */
  real32_T Gain_n;                     /* '<S96>/Gain' */
  real32_T Product_i;                  /* '<S97>/Product' */
  real32_T Sum_mr;                     /* '<S97>/Sum' */
  real32_T Product1_ao;                /* '<S97>/Product1' */
  real32_T Product3;                   /* '<S97>/Product3' */
  real32_T Sum1_m;                     /* '<S97>/Sum1' */
  real32_T Product3_n;                 /* '<S86>/Product3' */
  real32_T Product1_o;                 /* '<S93>/Product1' */
  real32_T Product2_c;                 /* '<S86>/Product2' */
  real32_T Gain_g;                     /* '<S88>/Gain' */
  real32_T Product3_n0;                /* '<S93>/Product3' */
  real32_T Sum1_c;                     /* '<S93>/Sum1' */
  real32_T Product1_h;                 /* '<S92>/Product1' */
  real32_T UnaryMinus_k;               /* '<S92>/Unary Minus' */
  real32_T UnaryMinus_f;               /* '<S93>/Unary Minus' */
  real32_T Product2_a;                 /* '<S93>/Product2' */
  real32_T Product_gf;                 /* '<S93>/Product' */
  real32_T Sum_i;                      /* '<S93>/Sum' */
  real32_T Product_kc;                 /* '<S92>/Product' */
  real32_T UnaryMinus_fm;              /* '<S94>/Unary Minus' */
  real32_T Gain1_o;                    /* '<S91>/Gain1' */
  real32_T UnaryMinus1;                /* '<S91>/Unary Minus1' */
  real32_T Product2_d;                 /* '<S94>/Product2' */
  real32_T Gain_j;                     /* '<S91>/Gain' */
  real32_T UnaryMinus_i;               /* '<S91>/Unary Minus' */
  real32_T Product_f;                  /* '<S94>/Product' */
  real32_T Sum_e;                      /* '<S94>/Sum' */
  real32_T Product1_oz;                /* '<S94>/Product1' */
  real32_T Product3_nb;                /* '<S94>/Product3' */
  real32_T Sum1_k;                     /* '<S94>/Sum1' */
  real32_T UnaryMinus_j;               /* '<S95>/Unary Minus' */
  real32_T Product_n;                  /* '<S90>/Product' */
  real32_T Product3_c;                 /* '<S90>/Product3' */
  real32_T UnaryMinus1_b;              /* '<S90>/Unary Minus1' */
  real32_T Product5;                   /* '<S90>/Product5' */
  real32_T Sum1_i;                     /* '<S90>/Sum1' */
  real32_T Product2_o;                 /* '<S95>/Product2' */
  real32_T Product4;                   /* '<S90>/Product4' */
  real32_T Product1_b;                 /* '<S90>/Product1' */
  real32_T UnaryMinus_g;               /* '<S90>/Unary Minus' */
  real32_T Product2_f;                 /* '<S90>/Product2' */
  real32_T Sum_kn;                     /* '<S90>/Sum' */
  real32_T Product_gf3;                /* '<S95>/Product' */
  real32_T Sum_h;                      /* '<S95>/Sum' */
  real32_T Product1_d;                 /* '<S95>/Product1' */
  real32_T Product3_g;                 /* '<S95>/Product3' */
  real32_T Sum1_j;                     /* '<S95>/Sum1' */
  real32_T Sum_l[2];                   /* '<S88>/Sum' */
  real32_T Sum_n[2];                   /* '<S84>/Sum' */
  real32_T Gain1_c[2];                 /* '<S84>/Gain1' */
  real32_T Sum2_o[2];                  /* '<S84>/Sum2' */
  real32_T Gain2[2];                   /* '<S84>/Gain2' */
  real32_T Sum1_j4[2];                 /* '<S84>/Sum1' */
  real32_T Product_m[2];               /* '<S83>/Product' */
  real32_T Switch1_g[2];               /* '<S85>/Switch1' */
  real32_T Product_j[2];               /* '<S100>/Product' */
  real32_T UnitDelay_j[2];             /* '<S100>/Unit Delay' */
  real32_T Product1_ee[2];             /* '<S100>/Product1' */
  real32_T Add1_j[2];                  /* '<S100>/Add1' */
  real32_T Merge_k4;                   /* '<S101>/Merge' */
  real32_T Merge1;                     /* '<S101>/Merge1' */
  real32_T Merge_o[2];                 /* '<S110>/Merge' */
  real32_T Product_nv;                 /* '<S107>/Product' */
  real32_T Product1_n;                 /* '<S107>/Product1' */
  real32_T Sum_e2;                     /* '<S107>/Sum' */
  real32_T Merge_f;                    /* '<S107>/Merge' */
  real32_T Merge1_o;                   /* '<S107>/Merge1' */
  real32_T Merge_i;                    /* '<S109>/Merge' */
  real32_T Switch1_n[2];               /* '<S171>/Switch1' */
  real32_T Product_gh;                 /* '<S196>/Product' */
  real32_T UnitDelay_c;                /* '<S196>/Unit Delay' */
  real32_T Product1_l;                 /* '<S196>/Product1' */
  real32_T Add1_g;                     /* '<S196>/Add1' */
  real32_T Delay_j;                    /* '<S220>/Delay' */
  real32_T Merge_g;                    /* '<S227>/Merge' */
  real32_T indexing_i;                 /* '<S225>/indexing' */
  real32_T Lookup_m[4];                /* '<S225>/Lookup' */
  real32_T Sum5_i;                     /* '<S226>/Sum5' */
  real32_T DataTypeConversion1_d2;     /* '<S225>/Data Type Conversion1' */
  real32_T Sum2_eo;                    /* '<S225>/Sum2' */
  real32_T Product1_nl;                /* '<S226>/Product1' */
  real32_T Sum6_m;                     /* '<S226>/Sum6' */
  real32_T Product_la;                 /* '<S102>/Product' */
  real32_T Sum3_n;                     /* '<S226>/Sum3' */
  real32_T Product_a;                  /* '<S226>/Product' */
  real32_T Sum4_p;                     /* '<S226>/Sum4' */
  real32_T Product1_dd;                /* '<S102>/Product1' */
  real32_T Sum_b;                      /* '<S102>/Sum' */
  real32_T ProportionalGain;           /* '<S157>/Proportional Gain' */
  real32_T IntegralGain;               /* '<S149>/Integral Gain' */
  real32_T Integrator;                 /* '<S152>/Integrator' */
  real32_T Sum_d;                      /* '<S161>/Sum' */
  real32_T speed;                      /* '<S102>/Sum1' */
  real32_T Switch1_e[2];               /* '<S106>/Switch1' */
  real32_T Product_iq;                 /* '<S114>/Product' */
  real32_T UnitDelay_i;                /* '<S114>/Unit Delay' */
  real32_T Product1_ok;                /* '<S114>/Product1' */
  real32_T Add1_h;                     /* '<S114>/Add1' */
  real32_T Gain_l;                     /* '<S220>/Gain' */
  real32_T UnitDelay_o;                /* '<S221>/Unit Delay' */
  real32_T Add_gq;                     /* '<S223>/Add' */
  real32_T DataTypeConversion1_l;      /* '<S223>/Data Type Conversion1' */
  real32_T Add1_k;                     /* '<S223>/Add1' */
  real32_T Input;                      /* '<S224>/Input' */
  real32_T In1;                        /* '<S217>/In1' */
  real32_T Delay2;                     /* '<S207>/Delay2' */
  real32_T Delay3;                     /* '<S207>/Delay3' */
  real32_T Switch1_j[2];               /* '<S210>/Switch1' */
  real32_T Product_ex;                 /* '<S216>/Product' */
  real32_T UnitDelay_d;                /* '<S216>/Unit Delay' */
  real32_T Product1_dx;                /* '<S216>/Product1' */
  real32_T Add1_fb;                    /* '<S216>/Add1' */
  real32_T Gain_b;                     /* '<S207>/Gain' */
  real32_T Sum1_n;                     /* '<S207>/Sum1' */
  real32_T Gain1_n;                    /* '<S207>/Gain1' */
  real32_T Delay2_i;                   /* '<S208>/Delay2' */
  real32_T Delay3_a;                   /* '<S208>/Delay3' */
  real32_T Switch1_f[2];               /* '<S209>/Switch1' */
  real32_T Product_k3;                 /* '<S213>/Product' */
  real32_T UnitDelay_iy;               /* '<S213>/Unit Delay' */
  real32_T Product1_c;                 /* '<S213>/Product1' */
  real32_T Add1_c;                     /* '<S213>/Add1' */
  real32_T Gain_m4;                    /* '<S208>/Gain' */
  real32_T Sum1_ci;                    /* '<S208>/Sum1' */
  real32_T Gain1_l;                    /* '<S208>/Gain1' */
  real32_T Product_kg;                 /* '<S173>/Product' */
  real32_T Product1_pv;                /* '<S173>/Product1' */
  real32_T Switch1_d[2];               /* '<S198>/Switch1' */
  real32_T Product_fd;                 /* '<S206>/Product' */
  real32_T UnitDelay_ju;               /* '<S206>/Unit Delay' */
  real32_T Product1_dq;                /* '<S206>/Product1' */
  real32_T Add1_d;                     /* '<S206>/Add1' */
  real32_T Delay1_i;                   /* '<S199>/Delay1' */
  real32_T Sum_mt;                     /* '<S199>/Sum' */
  real32_T Gain1_g;                    /* '<S199>/Gain1' */
  real32_T Delay_d;                    /* '<S199>/Delay' */
  real32_T Gain2_i;                    /* '<S199>/Gain2' */
  real32_T Sum1_a0;                    /* '<S199>/Sum1' */
  real32_T Product_j2;                 /* '<S172>/Product' */
  real32_T Switch1_n2[2];              /* '<S197>/Switch1' */
  real32_T Product_p;                  /* '<S203>/Product' */
  real32_T UnitDelay_id;               /* '<S203>/Unit Delay' */
  real32_T Product1_p0;                /* '<S203>/Product1' */
  real32_T Add1_c4;                    /* '<S203>/Add1' */
  real32_T Delay1_p;                   /* '<S200>/Delay1' */
  real32_T Sum_mq;                     /* '<S200>/Sum' */
  real32_T Gain1_ng;                   /* '<S200>/Gain1' */
  real32_T Delay_o;                    /* '<S200>/Delay' */
  real32_T Gain2_o;                    /* '<S200>/Gain2' */
  real32_T Sum1_h;                     /* '<S200>/Sum1' */
  real32_T Product1_ap;                /* '<S172>/Product1' */
  real32_T Sum_o;                      /* '<S172>/Sum' */
  real32_T MathFunction;               /* '<S172>/Math Function' */
  real32_T Abs_k;                      /* '<S172>/Abs' */
  real32_T Delay2_m;                   /* '<S174>/Delay2' */
  real32_T Delay3_d;                   /* '<S174>/Delay3' */
  real32_T Switch1_i[2];               /* '<S178>/Switch1' */
  real32_T Product_ke;                 /* '<S188>/Product' */
  real32_T UnitDelay_p;                /* '<S188>/Unit Delay' */
  real32_T Product1_o1;                /* '<S188>/Product1' */
  real32_T Add1_m;                     /* '<S188>/Add1' */
  real32_T Gain_gx;                    /* '<S174>/Gain' */
  real32_T Sum1_ag;                    /* '<S174>/Sum1' */
  real32_T Gain1_gr;                   /* '<S174>/Gain1' */
  real32_T Delay2_e;                   /* '<S175>/Delay2' */
  real32_T Delay3_m;                   /* '<S175>/Delay3' */
  real32_T Switch1_b[2];               /* '<S176>/Switch1' */
  real32_T Product_j5;                 /* '<S182>/Product' */
  real32_T UnitDelay_m;                /* '<S182>/Unit Delay' */
  real32_T Product1_br;                /* '<S182>/Product1' */
  real32_T Add1_o;                     /* '<S182>/Add1' */
  real32_T Gain_gp;                    /* '<S175>/Gain' */
  real32_T Sum1_ed;                    /* '<S175>/Sum1' */
  real32_T Gain1_p;                    /* '<S175>/Gain1' */
  real32_T Delay_f1;                   /* '<S179>/Delay' */
  real32_T Delay1_m;                   /* '<S179>/Delay1' */
  real32_T Switch1_fq;                 /* '<S179>/Switch1' */
  real32_T Switch1_a[2];               /* '<S177>/Switch1' */
  real32_T Product_md;                 /* '<S185>/Product' */
  real32_T UnitDelay_pm;               /* '<S185>/Unit Delay' */
  real32_T Product1_cn;                /* '<S185>/Product1' */
  real32_T Add1_fo;                    /* '<S185>/Add1' */
  real32_T Square;                     /* '<S170>/Square' */
  real32_T Square1;                    /* '<S170>/Square1' */
  real32_T Sum2_k;                     /* '<S170>/Sum2' */
  real32_T Sqrt;                       /* '<S170>/Sqrt' */
  real32_T UnaryMinus_b;               /* '<S170>/Unary Minus' */
  real32_T Sum_ji;                     /* '<S179>/Sum' */
  real32_T Sqrt_g;                     /* '<S117>/Sqrt' */
  real32_T Divide;                     /* '<S117>/Divide' */
  real32_T Divide1;                    /* '<S117>/Divide1' */
  real32_T Switch1_dz[2];              /* '<S237>/Switch1' */
  real32_T Product_am[4];              /* '<S240>/Product' */
  real32_T UnitDelay_a[4];             /* '<S240>/Unit Delay' */
  real32_T Product1_j[4];              /* '<S240>/Product1' */
  real32_T Add1_jy[4];                 /* '<S240>/Add1' */
  real32_T Sum_bf[4];                  /* '<S239>/Sum' */
  real32_T Product_c;                  /* '<S263>/Product' */
  real32_T Sum3_k;                     /* '<S260>/Sum3' */
  real32_T Delay1_pl;                  /* '<S262>/Delay1' */
  real32_T Sum_jy;                     /* '<S262>/Sum' */
  real32_T Product_d;                  /* '<S262>/Product' */
  real32_T Delay_p;                    /* '<S262>/Delay' */
  real32_T Product1_n5;                /* '<S262>/Product1' */
  real32_T Sum1_em;                    /* '<S262>/Sum1' */
  real32_T Product2_i;                 /* '<S263>/Product2' */
  real32_T Sum1_p;                     /* '<S260>/Sum1' */
  real32_T Sum_p;                      /* '<S261>/Sum' */
  real32_T Switch1_eg[2];              /* '<S261>/Switch1' */
  real32_T Product_fdo;                /* '<S266>/Product' */
  real32_T UnitDelay_dy;               /* '<S266>/Unit Delay' */
  real32_T Product1_k;                 /* '<S266>/Product1' */
  real32_T Add1_jx;                    /* '<S266>/Add1' */
  real32_T Switch_g;                   /* '<S259>/Switch' */
  real32_T Product_iw;                 /* '<S255>/Product' */
  real32_T Sum3_n0;                    /* '<S252>/Sum3' */
  real32_T Delay1_a;                   /* '<S254>/Delay1' */
  real32_T Sum_ga;                     /* '<S254>/Sum' */
  real32_T Product_n3;                 /* '<S254>/Product' */
  real32_T Delay_b;                    /* '<S254>/Delay' */
  real32_T Product1_g;                 /* '<S254>/Product1' */
  real32_T Sum1_mn;                    /* '<S254>/Sum1' */
  real32_T Product2_b;                 /* '<S255>/Product2' */
  real32_T Sum1_as;                    /* '<S252>/Sum1' */
  real32_T Sum_a;                      /* '<S253>/Sum' */
  real32_T Switch1_o[2];               /* '<S253>/Switch1' */
  real32_T Product_lm;                 /* '<S258>/Product' */
  real32_T UnitDelay_e;                /* '<S258>/Unit Delay' */
  real32_T Product1_ba;                /* '<S258>/Product1' */
  real32_T Add1_i;                     /* '<S258>/Add1' */
  real32_T Switch_h;                   /* '<S251>/Switch' */
  real32_T DTC;                        /* '<S271>/DTC' */
  real32_T SpeedGain;                  /* '<S236>/SpeedGain' */
  real32_T Switch1_bs[2];              /* '<S235>/Switch1' */
  real32_T Product_pk;                 /* '<S269>/Product' */
  real32_T UnitDelay_dk;               /* '<S269>/Unit Delay' */
  real32_T Product1_al;                /* '<S269>/Product1' */
  real32_T Add1_p;                     /* '<S269>/Add1' */
  real32_T elect2mech;                 /* '<S81>/elect2mech' */
  real32_T Sum_dj;                     /* '<S265>/Sum' */
  real32_T Sum_ac;                     /* '<S257>/Sum' */
  real32_T Atan2;                      /* '<S249>/Atan2' */
  real32_T Switch_ds;                  /* '<S249>/Switch' */
  real32_T algDD;
  real32_T Gain_f;                     /* '<S250>/Gain' */
  real32_T Switch_c;                   /* '<S250>/Switch' */
  real32_T Bias;                       /* '<S250>/Bias' */
  real32_T UnitDelay1;                 /* '<S284>/Unit Delay1' */
  real32_T UnitDelay_g;                /* '<S284>/Unit Delay' */
  real32_T a;                          /* '<S284>/a' */
  real32_T Delay_k;                    /* '<S274>/Delay' */
  real32_T Sum2_g;                     /* '<S274>/Sum2' */
  real32_T Sum3_m;                     /* '<S284>/Sum3' */
  real32_T b_invg;                     /* '<S284>/b_inv*g' */
  real32_T Delay1_e;                   /* '<S284>/Delay1' */
  real32_T Sum4_b;                     /* '<S284>/Sum4' */
  real32_T Switch1_jq[2];              /* '<S276>/Switch1' */
  real32_T Product_c0;                 /* '<S288>/Product' */
  real32_T UnitDelay_ab;               /* '<S288>/Unit Delay' */
  real32_T Product1_en;                /* '<S288>/Product1' */
  real32_T Add1_dd;                    /* '<S288>/Add1' */
  real32_T UnitDelay1_k;               /* '<S285>/Unit Delay1' */
  real32_T UnitDelay_k;                /* '<S285>/Unit Delay' */
  real32_T a_e;                        /* '<S285>/a' */
  real32_T Delay_i;                    /* '<S275>/Delay' */
  real32_T Sum2_g2;                    /* '<S275>/Sum2' */
  real32_T Sum3_l;                     /* '<S285>/Sum3' */
  real32_T b_invg_o;                   /* '<S285>/b_inv*g' */
  real32_T Delay1_f;                   /* '<S285>/Delay1' */
  real32_T Sum4_m;                     /* '<S285>/Sum4' */
  real32_T Switch1_m[2];               /* '<S277>/Switch1' */
  real32_T Product_p3;                 /* '<S291>/Product' */
  real32_T UnitDelay_gx;               /* '<S291>/Unit Delay' */
  real32_T Product1_k4;                /* '<S291>/Product1' */
  real32_T Add1_gu;                    /* '<S291>/Add1' */
  real32_T Merge_ku;                   /* '<S273>/Merge' */
  real32_T Merge1_i;                   /* '<S273>/Merge1' */
  real32_T Delay_e;                    /* '<S272>/Delay' */
  real32_T Sign;                       /* '<S274>/Sign' */
  real32_T Eta;                        /* '<S274>/Eta' */
