giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
  real32_T Sum_gf;                     /* '<S274>/Sum' */
  real32_T b;                          /* '<S274>/b' */
  real32_T a_a;                        /* '<S274>/a' */
  real32_T Sum1_d;                     /* '<S274>/Sum1' */
  real32_T Sign_m;                     /* '<S275>/Sign' */
  real32_T Eta_n;                      /* '<S275>/Eta' */
  real32_T Sum_bl;                     /* '<S275>/Sum' */
  real32_T b_i;                        /* '<S275>/b' */
  real32_T a_p;                        /* '<S275>/a' */
  real32_T Sum1_g;                     /* '<S275>/Sum1' */
  real32_T DTC_e;                      /* '<S296>/DTC' */
  real32_T SpeedGain_k;                /* '<S279>/SpeedGain' */
  real32_T Switch1_bp[2];              /* '<S278>/Switch1' */
  real32_T Product_i2;                 /* '<S294>/Product' */
  real32_T UnitDelay_ci;               /* '<S294>/Unit Delay' */
  real32_T Product1_ey;                /* '<S294>/Product1' */
  real32_T Add1_cr;                    /* '<S294>/Add1' */
  real32_T Product_jt;                 /* '<S280>/Product' */
  real32_T Product2_il;                /* '<S280>/Product2' */
  real32_T Sum1_mc;                    /* '<S280>/Sum1' */
  real32_T Product1_m;                 /* '<S280>/Product1' */
  real32_T Product3_b;                 /* '<S280>/Product3' */
  real32_T Sum2_p;                     /* '<S280>/Sum2' */
  real32_T Switch_cx;                  /* '<S280>/Switch' */
  real32_T Atan2_n;                    /* '<S297>/Atan2' */
  real32_T Switch_gb;                  /* '<S297>/Switch' */
  real32_T algDD_a;
  real32_T Gain_o;                     /* '<S298>/Gain' */
  real32_T Switch_m;                   /* '<S298>/Switch' */
  real32_T Bias_f;                     /* '<S298>/Bias' */
  real32_T Bias_j;                     /* '<S280>/Bias' */
  real32_T Input_h;                    /* '<S52>/Input' */
  real32_T qcos;                       /* '<S49>/qcos' */
  real32_T dsin;                       /* '<S49>/dsin' */
  real32_T sum_beta;                   /* '<S49>/sum_beta' */
  real32_T dcos;                       /* '<S49>/dcos' */
  real32_T qsin;                       /* '<S49>/qsin' */
  real32_T sum_alpha;                  /* '<S49>/sum_alpha' */
  real32_T Switch_f[2];                /* '<S50>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
  real32_T V_q_ref;                    /* '<S28>/MATLAB Function' */
  real32_T Saturation;                 /* '<S27>/Saturation' */
  real32_T V_d_ref;                    /* '<S27>/MATLAB Function' */
  real32_T Product_ch[2];              /* '<S33>/Product' */
  real32_T SquareRoot;                 /* '<S33>/Square Root' */
  real32_T Switch_o;                   /* '<S33>/Switch' */
  real32_T Switch_i[2];                /* '<S30>/Switch' */
  real32_T Switch2;                    /* '<S40>/Switch2' */
  real32_T Product_bp;                 /* '<S39>/Product' */
  real32_T Sum_a3;                     /* '<S39>/Sum' */
  real32_T Product2_ao;                /* '<S39>/Product2' */
  real32_T Merge_e;                    /* '<S39>/Merge' */
  real32_T Gain_lx;                    /* '<S39>/Gain' */
  real32_T Switch_k;                   /* '<S40>/Switch' */
  real32_T Switch1_h;                  /* '<S41>/Switch1' */
  real32_T Sqrt_n;                     /* '<S41>/Sqrt' */
  real32_T Gain_e;                     /* '<S41>/Gain' */
  int32_T DataTypeConversion_ch[2];    /* '<S78>/Data Type Conversion' */
  int32_T Add_k[2];                    /* '<S78>/Add' */
  int32_T Q17perunitconversion[2];     /* '<S78>/Q17 per unit conversion' */
  int32_T SpeedCount;                  /* '<S236>/SpeedCount' */
  int32_T SpeedCount_c;                /* '<S279>/SpeedCount' */
  uint16_T DataTypeConversion_b;       /* '<S400>/Data Type Conversion' */
  uint16_T Get_Integer;                /* '<S398>/Get_Integer' */
  uint16_T Divide_h;                   /* '<S311>/Divide' */
  uint16_T Divide1_e;                  /* '<S311>/Divide1' */
  uint16_T ForIterator;                /* '<S314>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S314>/IA//IB Measurement' */
  uint16_T Memory;                     /* '<S319>/Memory' */
  uint16_T Sum_dn;                     /* '<S319>/Sum' */
  uint16_T Memory1;                    /* '<S319>/Memory1' */
  uint16_T Sum1_dq;                    /* '<S319>/Sum1' */
  uint16_T SCIReceive[2];              /* '<S325>/SCI Receive' */
  uint16_T DataStoreRead_m;            /* '<S78>/Data Store Read' */
  uint16_T DataStoreRead1_p;           /* '<S78>/Data Store Read1' */
  uint16_T IAIBMeasurement_k[2];       /* '<S77>/IA//IB Measurement' */
  uint16_T Switch1_fg;                 /* '<S31>/Switch1' */
  uint16_T DataTypeConversion_e;       /* '<S57>/Data Type Conversion' */
  uint16_T Get_Integer_i;              /* '<S55>/Get_Integer' */
  uint16_T Output;                     /* '<S70>/Output' */
  uint16_T DataTypeConversion3[2];     /* '<S72>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[3];             /* '<S10>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S10>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S75>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S76>/FixPt Switch' */
  uint16_T Switch1_c[3];               /* '<S299>/Switch1' */
  uint16_T IndexVector;                /* '<S301>/Index Vector' */
  uint16_T Add_m;                      /* '<S301>/Add' */
  uint16_T Scale_to_PWM_Counter_PRD[3];/* '<S299>/Scale_to_PWM_Counter_PRD' */
  uint16_T DataTypeConversion_n;       /* '<S227>/Data Type Conversion' */
  uint16_T Get_Integer_m;              /* '<S225>/Get_Integer' */
  uint16_T Data[2];                    /* '<S71>/Data' */
  uint16_T Data_f[2];                  /* '<S73>/Data' */
  uint16_T Data_fw[2];                 /* '<S74>/Data' */
  uint16_T DataTypeConversion_k;       /* '<S29>/Data Type Conversion' */
  uint16_T DataTypeConversion_a;       /* '<S39>/Data Type Conversion' */
  int16_T DataTypeConversion2[2];      /* '<S323>/Data Type Conversion2' */
  int16_T DataTypeConversion_l[2];     /* '<S72>/Data Type Conversion' */
  int16_T DataTypeConversion_ey;       /* '<S51>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S301>/While Iterator' */
  int16_T DataTypeConversion_h;        /* '<S223>/Data Type Conversion' */
  boolean_T RT5;                       /* '<S8>/RT5' */
  boolean_T NOT;                       /* '<S8>/NOT' */
  boolean_T Enable;                    /* '<S8>/State Machine OL - CL' */
  boolean_T EnClosedLoop;              /* '<S8>/State Machine OL - CL' */
  boolean_T Compare;                   /* '<S402>/Compare' */
  boolean_T NOT_h;                     /* '<S310>/NOT' */
  boolean_T DataTypeConversion3_b;     /* '<S6>/Data Type Conversion3' */
  boolean_T DataStoreRead1_n;          /* '<S19>/Data Store Read1' */
  boolean_T Delay_kh;                  /* '<S51>/Delay' */
  boolean_T DataStoreRead2_m;          /* '<S19>/Data Store Read2' */
  boolean_T Compare_d;                 /* '<S59>/Compare' */
  boolean_T DataStoreRead1_b;          /* '<S28>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S28>/Logical Operator' */
  boolean_T DataStoreRead1_f;          /* '<S27>/Data Store Read1' */
  boolean_T LogicalOperator_e;         /* '<S27>/Logical Operator' */
  boolean_T Enable_l;                  /* '<S14>/Enable' */
  boolean_T DataStoreRead1_g;          /* '<S80>/Data Store Read1' */
  boolean_T LogicalOperator_l;         /* '<S80>/Logical Operator' */
  boolean_T AlphaRelay;                /* '<S101>/AlphaRelay' */
  boolean_T BetaRelay;                 /* '<S101>/BetaRelay' */
  boolean_T Compare_j;                 /* '<S115>/Compare' */
  boolean_T Compare_k;                 /* '<S229>/Compare' */
  boolean_T NOT_hg;                    /* '<S221>/NOT' */
  boolean_T Delay_bv;                  /* '<S223>/Delay' */
  boolean_T Compare_n;                 /* '<S190>/Compare' */
  boolean_T Compare_kj;                /* '<S192>/Compare' */
  boolean_T Compare_o;                 /* '<S189>/Compare' */
  boolean_T LogicalOperator1;          /* '<S179>/Logical Operator1' */
  boolean_T Compare_d4;                /* '<S193>/Compare' */
  boolean_T LogicalOperator2;          /* '<S179>/Logical Operator2' */
  boolean_T AND;                       /* '<S179>/AND' */
  boolean_T UnitDelay_cp;              /* '<S179>/Unit Delay' */
  boolean_T Switch_l;                  /* '<S179>/Switch' */
  boolean_T Compare_c;                 /* '<S191>/Compare' */
  boolean_T LogicalOperator_k;         /* '<S179>/Logical Operator' */
  boolean_T DataStoreRead1_c;          /* '<S81>/Data Store Read1' */
  boolean_T LogicalOperator_ed;        /* '<S81>/Logical Operator' */
  boolean_T DataStoreRead1_i;          /* '<S82>/Data Store Read1' */
  boolean_T LogicalOperator_i;         /* '<S82>/Logical Operator' */
  boolean_T AlphaRelay_p;              /* '<S273>/AlphaRelay' */
  boolean_T BetaRelay_j;               /* '<S273>/BetaRelay' */
  boolean_T RelationalOperator;        /* '<S29>/Relational Operator' */
  boolean_T Compare_n2;                /* '<S35>/Compare' */
  boolean_T Compare_m;                 /* '<S36>/Compare' */
  boolean_T LowerRelop1;               /* '<S40>/LowerRelop1' */
  boolean_T RelationalOperator_c;      /* '<S39>/Relational Operator' */
  boolean_T UpperRelop;                /* '<S40>/UpperRelop' */
  rtB_RunModeComputeId0_mcb_pmsm_ RunModeComputeId0;/* '<S389>/RunMode.ComputeId0' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_s TwoinputsCRL_j;/* '<S393>/Two inputs CRL' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_b;/* '<S400>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_ey;/* '<S400>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_s TwoinputsCRL_c;/* '<S391>/Two inputs CRL' */
  rtB_TwophaseCRLwrap_mcb_pmsm_fo TwophaseCRLwrap_b;/* '<S394>/Two phase CRL wrap' */
  rtB_SpeedControl_mcb_pmsm_foc_s SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer1;/* '<S312>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer;/* '<S312>/SPI Master Transfer' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_o;/* '<S227>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_e;/* '<S227>/If Action Subsystem' */
  rtB_Dir_Sense_mcb_pmsm_foc_sens Dir_Sense_m;/* '<S101>/Dir_Sense' */
  rtB_Dir_Sense_mcb_pmsm_foc_sens Dir_Sense;/* '<S273>/Dir_Sense' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1;/* '<S57>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem;/* '<S57>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_s TwoinputsCRL_m;/* '<S20>/Two inputs CRL' */
  rtB_TwophaseCRLwrap_mcb_pmsm_fo TwophaseCRLwrap;/* '<S23>/Two phase CRL wrap' */
} BlockIO_mcb_pmsm_foc_sensorless;

