giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real_T Add_DWORK1;                   /* '<S26>/Add' */
  real32_T UnitDelay_DSTATE;           /* '<S8>/Unit Delay' */
  real32_T Delay5_DSTATE[4];           /* '<S1>/Delay5' */
  real32_T Delay_DSTATE;               /* '<S19>/Delay' */
  real32_T UnitDelay_DSTATE_g;         /* '<S47>/Unit Delay' */
  real32_T Delay1_DSTATE;              /* '<S83>/Delay1' */
  real32_T Delay_DSTATE_o[2];          /* '<S84>/Delay' */
  real32_T Delay_DSTATE_a;             /* '<S220>/Delay' */
  real32_T Integrator_DSTATE;          /* '<S152>/Integrator' */
  real32_T Delay2_DSTATE;              /* '<S207>/Delay2' */
  real32_T Delay3_DSTATE;              /* '<S207>/Delay3' */
  real32_T Delay2_DSTATE_i;            /* '<S208>/Delay2' */
  real32_T Delay3_DSTATE_b;            /* '<S208>/Delay3' */
  real32_T Delay1_DSTATE_o;            /* '<S199>/Delay1' */
  real32_T Delay_DSTATE_ao;            /* '<S199>/Delay' */
  real32_T Delay1_DSTATE_n;            /* '<S200>/Delay1' */
  real32_T Delay_DSTATE_oe;            /* '<S200>/Delay' */
  real32_T Delay2_DSTATE_c;            /* '<S174>/Delay2' */
  real32_T Delay3_DSTATE_d;            /* '<S174>/Delay3' */
  real32_T Delay2_DSTATE_p;            /* '<S175>/Delay2' */
  real32_T Delay3_DSTATE_ds;           /* '<S175>/Delay3' */
  real32_T UnitDelay_DSTATE_d5[4];     /* '<S240>/Unit Delay' */
  real32_T Delay1_DSTATE_e;            /* '<S262>/Delay1' */
  real32_T Delay_DSTATE_m;             /* '<S262>/Delay' */
  real32_T UnitDelay_DSTATE_m;         /* '<S266>/Unit Delay' */
  real32_T Delay1_DSTATE_m;            /* '<S254>/Delay1' */
  real32_T Delay_DSTATE_p;             /* '<S254>/Delay' */
  real32_T UnitDelay_DSTATE_b;         /* '<S258>/Unit Delay' */
  real32_T UnitDelay_DSTATE_a1;        /* '<S269>/Unit Delay' */
  real32_T Delay_DSTATE_nd;            /* '<S274>/Delay' */
  real32_T Delay1_DSTATE_l;            /* '<S284>/Delay1' */
  real32_T Delay_DSTATE_e;             /* '<S275>/Delay' */
  real32_T Delay1_DSTATE_j;            /* '<S285>/Delay1' */
  real32_T Delay_DSTATE_nm;            /* '<S272>/Delay' */
  uint32_T Delay_DSTATE_ad[10];        /* '<S236>/Delay' */
  volatile real32_T RT6_Buffer[2];     /* '<S8>/RT6' */
  volatile real32_T RT4_Buffer[2];     /* '<Root>/RT4' */
  volatile real32_T RT2_Buffer[4];     /* '<Root>/RT2' */
  real32_T Iq_ref_initial;             /* '<Root>/Data Store Memory' */
  real32_T Ia_meas_PU;                 /* '<Root>/Data Store Memory11' */
  real32_T Vd_out_initial;             /* '<Root>/Data Store Memory12' */
  real32_T Vq_out_initial;             /* '<Root>/Data Store Memory13' */
  real32_T Id0_out;                    /* '<Root>/Data Store Memory15' */
  real32_T SpdCtrlRef;                 /* '<Root>/Data Store Memory16' */
  real32_T V_alpha;                    /* '<Root>/Data Store Memory17' */
  real32_T V_beta;                     /* '<Root>/Data Store Memory18' */
  real32_T Ib_meas_PU;                 /* '<Root>/Data Store Memory8' */
  real32_T Pos_meas_PU;                /* '<Root>/Data Store Memory9' */
  real32_T integrator_state;           /* '<S28>/MATLAB Function' */
  real32_T integrator_state_a;         /* '<S27>/MATLAB Function' */
  int32_T DigitalOutput1_FRAC_LEN;     /* '<S321>/Digital Output1' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S312>/Digital Output' */
  int32_T Add_DWORK1_o[2];             /* '<S78>/Add' */
  int32_T DigitalOutput_FRAC_LEN_h;    /* '<S299>/Digital Output' */
  int32_T SpeedCount_DWORK1;           /* '<S236>/SpeedCount' */
  uint32_T Sum_DWORK1[4];              /* '<S398>/Sum' */
  uint32_T Sum_DWORK1_h[4];            /* '<S55>/Sum' */
  uint16_T Output_DSTATE;              /* '<S70>/Output' */
  volatile int16_T RT6_ActiveBufIdx;   /* '<S8>/RT6' */
  volatile int16_T RT6_semaphoreTaken; /* '<S8>/RT6' */
  volatile int16_T RT4_ActiveBufIdx;   /* '<Root>/RT4' */
  volatile int16_T RT4_semaphoreTaken; /* '<Root>/RT4' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  uint16_T IaOffset;                   /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset;                   /* '<Root>/Data Store Memory2' */
  uint16_T temporalCounter_i1;         /* '<S8>/State Machine OL - CL' */
  uint16_T Memory_PreviousInput;       /* '<S319>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S319>/Memory1' */
  uint16_T Add_DWORK1_oy;              /* '<S301>/Add' */
  uint16_T CircBufIdx;                 /* '<S236>/Delay' */
  uint16_T CircBufIdx_n;               /* '<S279>/Delay' */
  boolean_T Delay_DSTATE_d;            /* '<S51>/Delay' */
  int16_T Integrator_PrevResetState;   /* '<S152>/Integrator' */
  uint16_T is_active_c3_mcb_pmsm_foc_senso;/* '<S8>/State Machine OL - CL' */
  uint16_T is_c3_mcb_pmsm_foc_sensorless_f;/* '<S8>/State Machine OL - CL' */
  uint16_T is_RunMode;                 /* '<S8>/State Machine OL - CL' */
  uint16_T is_NegativeSpeedRun;        /* '<S8>/State Machine OL - CL' */
  uint16_T is_PositiveSpeedRun;        /* '<S8>/State Machine OL - CL' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T EnClosedLoop;              /* '<Root>/Data Store Memory5' */
  boolean_T icLoad;                    /* '<S19>/Delay' */
  boolean_T AlphaRelay_Mode;           /* '<S101>/AlphaRelay' */
  boolean_T BetaRelay_Mode;            /* '<S101>/BetaRelay' */
  boolean_T AlphaRelay_Mode_c;         /* '<S273>/AlphaRelay' */
  boolean_T BetaRelay_Mode_j;          /* '<S273>/BetaRelay' */
  rtDW_SpeedControl_mcb_pmsm_foc_ SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer1;/* '<S312>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer;/* '<S312>/SPI Master Transfer' */
} D_Work_mcb_pmsm_foc_sensorless_;

/* Zero-crossing (trigger) state */
typedef struct {
  ZCSigState Delay_Reset_ZCE;          /* '<S19>/Delay' */
  ZCSigState Delay1_Reset_ZCE;         /* '<S83>/Delay1' */
  ZCSigState Delay_Reset_ZCE_g;        /* '<S84>/Delay' */
  ZCSigState Delay_Reset_ZCE_m;        /* '<S220>/Delay' */
  ZCSigState Delay2_Reset_ZCE;         /* '<S207>/Delay2' */
  ZCSigState Delay3_Reset_ZCE;         /* '<S207>/Delay3' */
  ZCSigState Delay2_Reset_ZCE_g;       /* '<S208>/Delay2' */
  ZCSigState Delay3_Reset_ZCE_g;       /* '<S208>/Delay3' */
  ZCSigState Delay1_Reset_ZCE_d;       /* '<S199>/Delay1' */
  ZCSigState Delay_Reset_ZCE_l;        /* '<S199>/Delay' */
  ZCSigState Delay1_Reset_ZCE_db;      /* '<S200>/Delay1' */
  ZCSigState Delay_Reset_ZCE_gg;       /* '<S200>/Delay' */
  ZCSigState Delay2_Reset_ZCE_p;       /* '<S174>/Delay2' */
  ZCSigState Delay3_Reset_ZCE_p;       /* '<S174>/Delay3' */
  ZCSigState Delay2_Reset_ZCE_h;       /* '<S175>/Delay2' */
  ZCSigState Delay3_Reset_ZCE_c;       /* '<S175>/Delay3' */
  rtZCE_Dir_Sense_mcb_pmsm_foc_se Dir_Sense_m;/* '<S101>/Dir_Sense' */
  ZCSigState Delay1_Reset_ZCE_e;       /* '<S262>/Delay1' */
  ZCSigState Delay_Reset_ZCE_p;        /* '<S262>/Delay' */
  ZCSigState Delay1_Reset_ZCE_l;       /* '<S254>/Delay1' */
  ZCSigState Delay_Reset_ZCE_d;        /* '<S254>/Delay' */
  ZCSigState Delay_Reset_ZCE_n;        /* '<S274>/Delay' */
  ZCSigState Delay1_Reset_ZCE_b;       /* '<S284>/Delay1' */
  ZCSigState Delay_Reset_ZCE_ld;       /* '<S275>/Delay' */
  ZCSigState Delay1_Reset_ZCE_bl;      /* '<S285>/Delay1' */
  ZCSigState Delay_Reset_ZCE_n0;       /* '<S272>/Delay' */
  rtZCE_Dir_Sense_mcb_pmsm_foc_se Dir_Sense;/* '<S273>/Dir_Sense' */
} PrevZCSigStates_mcb_pmsm_foc_se;

/* Invariant block signals (default storage) */
typedef struct {
  const real_T Product2;               /* '<S26>/Product2' */
  const uint16_T Width;                /* '<S10>/Width' */
} ConstBlockIO_mcb_pmsm_foc_senso;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Expression: )
   * Referenced by:
   *   '<S55>/sine_table_values'
   *   '<S398>/sine_table_values'
   *   '<S225>/sine_table_values'
   */
  real32_T pooled31[1002];
} ConstParam_mcb_pmsm_foc_sensorl;

/* Real-time Model Data Structure */
struct tag_RTM_mcb_pmsm_foc_sensorless {
  const char_T * volatile errorStatus;

