giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[2];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_mcb_pmsm_foc_sensorless mcb_pmsm_foc_sensorless_f2806_B;

/* Block states (default storage) */
extern D_Work_mcb_pmsm_foc_sensorless_ mcb_pmsm_foc_sensorless_f_DWork;

/* Zero-crossing (trigger) state */
extern PrevZCSigStates_mcb_pmsm_foc_se mcb_pmsm_foc_sen_PrevZCSigState;
extern const ConstBlockIO_mcb_pmsm_foc_senso mcb_pmsm_foc_sensorless__ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_mcb_pmsm_foc_sensorl mcb_pmsm_foc_sensorless__ConstP;

/* External function called from main */
extern void mcb_pmsm_foc_sensorless_f28069MLaunchPad_SetEventsForThisBaseStep
  (boolean_T *eventFlags);

/* Model entry point functions */
extern void mcb_pmsm_foc_sensorless_f28069MLaunchPad_initialize(void);
extern void mcb_pmsm_foc_sensorless_f28069MLaunchPad_step0(void);/* Sample time: [0.0005s, 0.0s] */
extern void mcb_pmsm_foc_sensorless_f28069MLaunchPad_step1(void);/* Sample time: [0.5s, 0.0s] */
extern void mcb_pmsm_foc_sensorless_f28069MLaunchPad_terminate(void);

/* Real-time Model object */
extern RT_MODEL_mcb_pmsm_foc_sensorles *const mcb_pmsm_foc_sensorless_f280_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void SCIRXINTA(void);
  interrupt void ADCINT1(void);
  void mcb_pmsm_foc_sensorless_f28069MLaunchPad_configure_interrupts (void);
  void mcb_pmsm_foc_sensorless_f28069MLaunchPad_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad'
 * '<S1>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control'
 * '<S2>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt'
 * '<S3>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init'
 * '<S4>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Heartbeat LED'
 * '<S5>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Inverter and Motor - Plant Model'
 * '<S6>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Serial Receive'
 * '<S7>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control'
 * '<S8>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler'
 * '<S9>'   : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop'
 * '<S10>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging'
 * '<S11>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/HW Inputs'
 * '<S12>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling'
 * '<S13>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Inverter'
 * '<S14>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Output Scaling'
 * '<S15>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/SCI_Tx'
 * '<S16>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Clarke Transform'
 * '<S17>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers'
 * '<S18>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Inverse Park Transform'
 * '<S19>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Open_Loop_Control'
 * '<S20>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Park Transform'
 * '<S21>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup'
 * '<S22>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator'
 * '<S23>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Clarke Transform/Two phase input'
 * '<S24>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S25>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter'
 * '<S26>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/Non-linear compensation'
 * '<S27>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id'
 * '<S28>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq'
 * '<S29>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S30>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S31>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
 * '<S32>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/Magnitude_calc'
 * '<S33>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence/Limiter'
 * '<S34>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D-Q Equivalence/Passthrough'
 * '<S35>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant'
 * '<S36>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant1'
 * '<S37>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs'
 * '<S38>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs1'
 * '<S39>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter'
 * '<S40>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef1'
 * '<S41>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef2'
 * '<S42>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/passThrough'
 * '<S43>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/IIR Filter'
 * '<S44>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/MATLAB Function'
 * '<S45>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/IIR Filter/IIR Filter'
 * '<S46>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/IIR Filter/IIR Filter/Low-pass'
 * '<S47>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Id/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S48>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Current_Controllers/PI_Controller_Iq/MATLAB Function'
 * '<S49>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Inverse Park Transform/Two inputs CRL'
 * '<S50>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Inverse Park Transform/Two inputs CRL/Switch_Axis'
 * '<S51>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Open_Loop_Control/Accumulate1'
 * '<S52>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Open_Loop_Control/Accumulate1/Subsystem'
 * '<S53>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Park Transform/Two inputs CRL'
 * '<S54>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Park Transform/Two inputs CRL/Switch_Axis'
 * '<S55>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup'
 * '<S56>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/Interpolation'
 * '<S57>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp'
 * '<S58>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype'
 * '<S59>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S60>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S61>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S62>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype/datatype backpropogation'
 * '<S63>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Modulation method'
 * '<S64>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Voltage Input'
 * '<S65>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Modulation method/SVPWM'
 * '<S66>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S67>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S68>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S69>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Closed Loop/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform/Two phase input'
 * '<S70>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/Counter Limited'
 * '<S71>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/Data'
 * '<S72>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/Data_Conditioning'
 * '<S73>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/End'
 * '<S74>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/Start'
 * '<S75>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/Counter Limited/Increment Real World'
 * '<S76>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Data_Logging/Counter Limited/Wrap To Zero'
 * '<S77>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/HW Inputs/Sensor Driver Blocks (codegen)'
 * '<S78>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate Phase Currents'
 * '<S79>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed'
 * '<S80>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer'
 * '<S81>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer'
 * '<S82>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer'
 * '<S83>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer'
 * '<S84>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer'
 * '<S85>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/IIR Filter'
 * '<S86>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/PerUnit'
 * '<S87>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer'
 * '<S88>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem'
 * '<S89>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem2'
 * '<S90>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem/A11'
 * '<S91>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem/A12'
 * '<S92>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem/A22'
 * '<S93>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem/L'
 * '<S94>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem/L1'
 * '<S95>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem/L2'
 * '<S96>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem2/B'
 * '<S97>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/EEMF Observer/Subsystem2/L'
 * '<S98>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/IIR Filter/IIR Filter'
 * '<S99>'  : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/IIR Filter/IIR Filter/Low-pass'
 * '<S100>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S101>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/Direction_Latch'
 * '<S102>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL'
 * '<S103>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/Direction_Latch/Dir_Sense'
 * '<S104>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/Direction_Latch/Subsystem2'
 * '<S105>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/Direction_Latch/Subsystem3'
 * '<S106>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/IIR Filter'
 * '<S107>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Normalize'
 * '<S108>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller'
 * '<S109>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward'
 * '<S110>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Subsystem'
 * '<S111>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO'
 * '<S112>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/IIR Filter/IIR Filter'
 * '<S113>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/IIR Filter/IIR Filter/Low-pass'
 * '<S114>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S115>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Normalize/Compare To Zero'
 * '<S116>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Normalize/If Action Subsystem'
 * '<S117>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Normalize/Subsystem'
 * '<S118>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Anti-windup'
 * '<S119>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/D Gain'
 * '<S120>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/External Derivative'
 * '<S121>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Filter'
 * '<S122>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Filter ICs'
 * '<S123>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/I Gain'
 * '<S124>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Ideal P Gain'
 * '<S125>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Ideal P Gain Fdbk'
 * '<S126>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Integrator'
 * '<S127>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Integrator ICs'
 * '<S128>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/N Copy'
 * '<S129>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/N Gain'
 * '<S130>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/P Copy'
 * '<S131>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Parallel P Gain'
 * '<S132>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Reset Signal'
 * '<S133>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Saturation'
 * '<S134>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Saturation Fdbk'
 * '<S135>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Sum'
 * '<S136>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Sum Fdbk'
 * '<S137>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tracking Mode'
 * '<S138>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tracking Mode Sum'
 * '<S139>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tsamp - Integral'
 * '<S140>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tsamp - Ngain'
 * '<S141>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/postSat Signal'
