giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
 * '<S142>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/preInt Signal'
 * '<S143>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/preSat Signal'
 * '<S144>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Anti-windup/Passthrough'
 * '<S145>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/D Gain/Disabled'
 * '<S146>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/External Derivative/Disabled'
 * '<S147>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Filter/Disabled'
 * '<S148>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Filter ICs/Disabled'
 * '<S149>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/I Gain/Internal Parameters'
 * '<S150>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Ideal P Gain/Passthrough'
 * '<S151>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Ideal P Gain Fdbk/Disabled'
 * '<S152>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Integrator/Discrete'
 * '<S153>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Integrator ICs/Internal IC'
 * '<S154>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/N Copy/Disabled wSignal Specification'
 * '<S155>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/N Gain/Disabled'
 * '<S156>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/P Copy/Disabled'
 * '<S157>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Parallel P Gain/Internal Parameters'
 * '<S158>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Reset Signal/External Reset'
 * '<S159>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Saturation/Passthrough'
 * '<S160>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Saturation Fdbk/Disabled'
 * '<S161>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Sum/Sum_PI'
 * '<S162>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Sum Fdbk/Disabled'
 * '<S163>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tracking Mode/Disabled'
 * '<S164>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tracking Mode Sum/Passthrough'
 * '<S165>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tsamp - Integral/TsSignalSpecification'
 * '<S166>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/Tsamp - Ngain/Passthrough'
 * '<S167>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/postSat Signal/Forward_Path'
 * '<S168>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/preInt Signal/Internal PreInt'
 * '<S169>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/PID Controller/preSat Signal/Forward_Path'
 * '<S170>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod'
 * '<S171>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IIR Filter'
 * '<S172>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod'
 * '<S173>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod'
 * '<S174>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Differentiator'
 * '<S175>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Differentiator1'
 * '<S176>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter1'
 * '<S177>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter2'
 * '<S178>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter3'
 * '<S179>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Subsystem'
 * '<S180>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter1/IIR Filter'
 * '<S181>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter1/IIR Filter/Low-pass'
 * '<S182>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter1/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S183>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter2/IIR Filter'
 * '<S184>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter2/IIR Filter/Low-pass'
 * '<S185>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter2/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S186>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter3/IIR Filter'
 * '<S187>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter3/IIR Filter/Low-pass'
 * '<S188>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/IIR Filter3/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S189>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Subsystem/Compare To Constant'
 * '<S190>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Subsystem/Compare To Constant1'
 * '<S191>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Subsystem/Compare To Constant2'
 * '<S192>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Subsystem/Compare To Constant4'
 * '<S193>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/DifferentiationMethod/Subsystem/Compare To Constant5'
 * '<S194>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IIR Filter/IIR Filter'
 * '<S195>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IIR Filter/IIR Filter/Low-pass'
 * '<S196>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S197>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter1'
 * '<S198>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter3'
 * '<S199>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/Integrator'
 * '<S200>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/Integrator1'
 * '<S201>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter1/IIR Filter'
 * '<S202>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter1/IIR Filter/Low-pass'
 * '<S203>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter1/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S204>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter3/IIR Filter'
 * '<S205>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter3/IIR Filter/Low-pass'
 * '<S206>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/IntegralMethod/IIR Filter3/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S207>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/Differentiator'
 * '<S208>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/Differentiator1'
 * '<S209>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter1'
 * '<S210>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter3'
 * '<S211>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter1/IIR Filter'
 * '<S212>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter1/IIR Filter/Low-pass'
 * '<S213>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter1/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S214>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter3/IIR Filter'
 * '<S215>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter3/IIR Filter/Low-pass'
 * '<S216>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/SpeedFeedforward/OptimizedDifferentiationMethod/IIR Filter3/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S217>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Subsystem/If Action Subsystem'
 * '<S218>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/Subsystem/If Action Subsystem1'
 * '<S219>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem'
 * '<S220>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased'
 * '<S221>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Position Generator'
 * '<S222>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup'
 * '<S223>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Position Generator/Accumulate'
 * '<S224>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Position Generator/Accumulate/Subsystem'
 * '<S225>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup'
 * '<S226>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/Interpolation'
 * '<S227>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp'
 * '<S228>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype'
 * '<S229>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S230>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S231>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S232>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Extended EMF Observer/Extended EMF Observer/Speed Observer/PLL/VCO/Variant Subsystem/LookupTableBased/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype/datatype backpropogation'
 * '<S233>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal1'
 * '<S234>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer'
 * '<S235>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter'
 * '<S236>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement'
 * '<S237>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal1/IIR Filter'
 * '<S238>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal1/IIR Filter/IIR Filter'
 * '<S239>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal1/IIR Filter/IIR Filter/High-pass'
 * '<S240>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/DC component removal1/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S241>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2'
 * '<S242>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Data type Handling'
 * '<S243>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Flux Calculation'
 * '<S244>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/ParamBus'
 * '<S245>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/passthrough'
 * '<S246>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha'
 * '<S247>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta'
