giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/SensorlessFocFOSMOExample/mcb_pmsm_foc_sensorless_f28069MLaunchPad_ert_rtw/mcb_pmsm_foc_sensorless_f28069MLaunchPad.h
 * '<S248>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default'
 * '<S249>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default/atan2'
 * '<S250>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/Atan2/Default/atan2/Per Unit'
 * '<S251>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default'
 * '<S252>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc'
 * '<S253>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter'
 * '<S254>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/Integrator'
 * '<S255>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/Scaling'
 * '<S256>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter/IIR Filter'
 * '<S257>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter/IIR Filter/High-pass'
 * '<S258>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiAlpha/Default/FluxCalc/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S259>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default'
 * '<S260>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc'
 * '<S261>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter'
 * '<S262>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/Integrator'
 * '<S263>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/Scaling'
 * '<S264>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter/IIR Filter'
 * '<S265>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter/IIR Filter/High-pass'
 * '<S266>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Flux Observer/psiBeta/Default/FluxCalc/IIR Filter/IIR Filter/High-pass/IIR Low Pass Filter'
 * '<S267>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter'
 * '<S268>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter/Low-pass'
 * '<S269>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S270>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement/DT_Handle'
 * '<S271>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Flux Observer/Speed Measurement/DT_Handle/floating-point'
 * '<S272>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1'
 * '<S273>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch'
 * '<S274>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ealpha_est'
 * '<S275>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ebeta_est'
 * '<S276>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha'
 * '<S277>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta'
 * '<S278>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter'
 * '<S279>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Speed Measurement'
 * '<S280>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/angleCompensation'
 * '<S281>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch/Dir_Sense'
 * '<S282>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch/Subsystem2'
 * '<S283>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Direction_Latch/Subsystem3'
 * '<S284>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ealpha_est/DisturbanceObserver'
 * '<S285>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Ebeta_est/DisturbanceObserver'
 * '<S286>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha/IIR Filter'
 * '<S287>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha/IIR Filter/Low-pass'
 * '<S288>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ealpha/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S289>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta/IIR Filter'
 * '<S290>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta/IIR Filter/Low-pass'
 * '<S291>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Filter_Ebeta/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S292>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter/IIR Filter'
 * '<S293>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter/IIR Filter/Low-pass'
 * '<S294>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S295>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Speed Measurement/DT_Handle'
 * '<S296>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/Speed Measurement/DT_Handle/floating-point'
 * '<S297>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/angleCompensation/atan1'
 * '<S298>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Input Scaling/Calculate position and speed/Sliding Mode Observer/Sliding Mode Observer1/angleCompensation/atan1/Per Unit'
 * '<S299>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/Inverter/Code Generation'
 * '<S300>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/SCI_Tx/Code Generation'
 * '<S301>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Current Control/SCI_Tx/Code Generation/CodeGeneration'
 * '<S302>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation'
 * '<S303>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation/HWI_ADCINT1'
 * '<S304>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation/HWI_SCIRXINTA'
 * '<S305>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation/HWI_ADCINT1/ECSoC'
 * '<S306>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation/HWI_ADCINT1/ECSoC/ECSimCodegen'
 * '<S307>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation/HWI_SCIRXINTA/ECSoC'
 * '<S308>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/HW Interrrupt/Code generation/HWI_SCIRXINTA/ECSoC/ECSimCodegen'
 * '<S309>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem'
 * '<S310>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation'
 * '<S311>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset '
 * '<S312>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/DRV Enable'
 * '<S313>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Default ADC Offset'
 * '<S314>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /For Iterator Subsystem'
 * '<S315>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem'
 * '<S316>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem1'
 * '<S317>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem2'
 * '<S318>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem3'
 * '<S319>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /For Iterator Subsystem/If Action Subsystem'
 * '<S320>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Heartbeat LED/Heartbeat LED'
 * '<S321>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Heartbeat LED/Heartbeat LED/Code generation'
 * '<S322>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Inverter and Motor - Plant Model/Codegeneration'
 * '<S323>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Serial Receive/Data_Conditioning'
 * '<S324>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Serial Receive/SCI_Rx'
 * '<S325>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Serial Receive/SCI_Rx/Code Generation'
 * '<S326>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed'
 * '<S327>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/SlewRate'
 * '<S328>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset'
 * '<S329>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/MATLAB Function'
 * '<S330>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation'
 * '<S331>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S332>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S333>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/External Derivative'
 * '<S334>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S335>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S336>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S337>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S338>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S339>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S340>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S341>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S342>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S343>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S344>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S345>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S346>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S347>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S348>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S349>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S350>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S351>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S352>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S353>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S354>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S355>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preInt Signal'
 * '<S356>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S357>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S358>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S359>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S360>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S361>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/External Derivative/Disabled'
 * '<S362>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S363>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S364>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S365>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S366>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S367>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S368>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S369>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S370>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S371>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S372>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S373>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S374>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S375>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S376>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S377>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S378>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S379>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S380>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S381>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S382>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S383>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preInt Signal/Internal PreInt'
 * '<S384>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S385>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter'
 * '<S386>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass'
 * '<S387>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S388>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values'
 * '<S389>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/State Machine OL - CL'
 * '<S390>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Clarke Transform'
 * '<S391>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/I Park Transform'
 * '<S392>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup'
 * '<S393>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/V Park Transform'
 * '<S394>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Clarke Transform/Two phase input'
 * '<S395>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S396>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/I Park Transform/Two inputs CRL'
 * '<S397>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/I Park Transform/Two inputs CRL/Switch_Axis'
 * '<S398>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup'
 * '<S399>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/Interpolation'
 * '<S400>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp'
 * '<S401>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype'
 * '<S402>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S403>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S404>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S405>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/Sine-Cosine Lookup/Sine-Cosine Lookup/datatype/datatype backpropogation'
 * '<S406>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/V Park Transform/Two inputs CRL'
 * '<S407>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/Compute Control-loop Initial Values/V Park Transform/Two inputs CRL/Switch_Axis'
 * '<S408>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/State Machine OL - CL/RunMode.ComputeId0'
 * '<S409>' : 'mcb_pmsm_foc_sensorless_f28069MLaunchPad/State Machine Handler/State Machine OL - CL/RunMode.ComputeId0/Compare To Constant'
 */
#endif                         /* mcb_pmsm_foc_sensorless_f28069MLaunchPad_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
